Catalogs/Билеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Билеты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьПорядокПокупки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьПорядокПокупкиБилета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПокупки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДоговорАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСуммаНеОблагаемаяНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНДСНеВыделять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/ОперацияСБилетом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОперацияСБилетом</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПрочиеРасчеты</xr:Item>
				<xr:Item>AccumulationRegister.РасходыПриУСН</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСБилетами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Билет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Билеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БилетЗамена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Билеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНеОблагаемаяНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штраф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗачетаАвансов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыЗачетаАвансов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовСКонтрагентом</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаРасчетовПоАвансам</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗачетАвансов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументАванса</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаПоступления</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ОперацияСБилетом</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗачета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Билеты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция возвращает суммы билетов как итог операций с данными билетами
//
// Параметры:
//  Организация		 - СправочникСсылка.Организации - отбор билетов по организации
//  ПериодНачало	 - Дата - отбор билетов по периоду отправления
//  ПериодОкончание	 - Дата - отбор билетов по периоду отправления и дате покупки (если ВыбиратьДанныеОплаты = Истина, 
//  					то на указанную дату определяются последние документы оплаты по билетам)
//  Билет			 - СправочникСсылка.Организации - указывается билет, сумму которого необходимо получить. Если параметр указан, то период игнорируется 
//  Сотрудник		 - СправочникСсылка.ФизическиеЛица - сотрудник, по которому необходимо получить суммы билетов, по которым тот не отчитался
//  ТекущийДокумент	 - ДокументСсылка - документ, из которого вызвана функция, он не будет учтен в общем итоге операций
//  ВыбиратьДанныеОплаты - Булево - если Истина, то в итоговую таблицу добавляются колонки НомерДокументаОплаты и ДатаДокументаОплаты
// 
// Возвращаемое значение:
//   - ТаблицаЗначений с колонками
//		- Билет
//		- Сумма
//		- СуммаНДС
//		- СтавкаНДС
//		- НомерДокументаОплаты (опционально, если ВыбиратьДанныеОплаты = Истина)
//		- ДатаДокументаОплаты (опционально, если ВыбиратьДанныеОплаты = Истина)
//
Функция СуммыБилетов(Организация, ПериодНачало = Неопределено, ПериодОкончание = Неопределено, Билет = Неопределено, 
	 Сотрудник = Неопределено, ТекущийДокумент = Неопределено, ВыбиратьДанныеОплаты = Ложь) Экспорт 
	
	// Запрос ниже модифицируется с помощью СхемаЗапроса
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Билеты.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Билеты
	|ИЗ
	|	Справочник.Билеты КАК Билеты
	|ГДЕ
	|	Билеты.Организация = &Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОперацииСБилетами.Билет КАК Билет,
	|	СУММА(ОперацииСБилетами.Сумма) КАК Сумма,
	|	СУММА(ОперацииСБилетами.СуммаНДС) КАК СуммаНДС,
	|	МАКСИМУМ(ОперацииСБилетами.СтавкаНДС) КАК СтавкаНДС,
	|	МАКСИМУМ(ОперацииСБилетами.ПодразделениеОрганизации) КАК ПодразделениеОрганизации
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОперацияСБилетом.Билет КАК Билет,
	|		ВЫБОР
	|			КОГДА ОперацияСБилетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСБилетами.Возврат)
	|				ТОГДА -ОперацияСБилетом.Сумма
	|			ИНАЧЕ ОперацияСБилетом.Сумма
	|		КОНЕЦ КАК Сумма,
	|		ВЫБОР
	|			КОГДА ОперацияСБилетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСБилетами.Возврат)
	|				ТОГДА -ОперацияСБилетом.СуммаНДС
	|			ИНАЧЕ ОперацияСБилетом.СуммаНДС
	|		КОНЕЦ КАК СуммаНДС,
	|		ВЫБОР
	|			КОГДА ОперацияСБилетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСБилетами.Покупка)
	|					ИЛИ ОперацияСБилетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСБилетами.ЗаменаПокупка)
	|				ТОГДА ОперацияСБилетом.СтавкаНДС
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
	|		КОНЕЦ КАК СтавкаНДС,
	|		ВЫБОР
	|			КОГДА ОперацияСБилетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСБилетами.Покупка)
	|					ИЛИ ОперацияСБилетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСБилетами.ЗаменаПокупка)
	|				ТОГДА ОперацияСБилетом.ПодразделениеОрганизации
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|		КОНЕЦ КАК ПодразделениеОрганизации,
	|		ОперацияСБилетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСБилетами.ЗаменаВозврат)
	|			ИЛИ ОперацияСБилетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСБилетами.Обмен) КАК Заменен
	|	ИЗ
	|		Документ.ОперацияСБилетом КАК ОперацияСБилетом
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Билеты КАК ВТ_Билеты
	|			ПО ОперацияСБилетом.Билет = ВТ_Билеты.Ссылка
	|	ГДЕ
	|		ОперацияСБилетом.Организация = &Организация
	|		И ОперацияСБилетом.Проведен
	|		И ОперацияСБилетом.Ссылка <> &ТекущийДокумент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОперацияСБилетом.БилетЗамена,
	|		ОперацияСБилетом.Сумма,
	|		ОперацияСБилетом.СуммаНДС,
	|		ОперацияСБилетом.СтавкаНДС,
	|		ОперацияСБилетом.ПодразделениеОрганизации,
	|		ЛОЖЬ
	|	ИЗ
	|		Документ.ОперацияСБилетом КАК ОперацияСБилетом
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Билеты КАК ВТ_Билеты
	|			ПО ОперацияСБилетом.БилетЗамена = ВТ_Билеты.Ссылка
	|	ГДЕ
	|		ОперацияСБилетом.Организация = &Организация
	|		И ОперацияСБилетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСБилетами.Обмен)
	|		И ОперацияСБилетом.Проведен
	|		И ОперацияСБилетом.Ссылка <> &ТекущийДокумент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		АвансовыйОтчетБилеты.Билет,
	|		-АвансовыйОтчетБилеты.Сумма,
	|		-АвансовыйОтчетБилеты.СуммаНДС,
	|		ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка),
	|		ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка),
	|		ЛОЖЬ
	|	ИЗ
	|		Документ.АвансовыйОтчет.Билеты КАК АвансовыйОтчетБилеты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Билеты КАК ВТ_Билеты
	|			ПО АвансовыйОтчетБилеты.Билет = ВТ_Билеты.Ссылка
	|	ГДЕ
	|		АвансовыйОтчетБилеты.Ссылка.Организация = &Организация
	|		И АвансовыйОтчетБилеты.Ссылка.Проведен
	|		И АвансовыйОтчетБилеты.Ссылка <> &ТекущийДокумент) КАК ОперацииСБилетами
	|
	|СГРУППИРОВАТЬ ПО
	|	ОперацииСБилетами.Билет
	|
	|ИМЕЮЩИЕ
	|	НЕ ЕСТЬNULL(МАКСИМУМ(ОперацииСБилетами.Заменен), ЛОЖЬ) И
	|	СУММА(ОперацииСБилетами.Сумма) > 0";
		
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	
	УсловиеГДЕТаблицыБилетов = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;
	
	// При отборе по конкретному билету, не используем отбор по периоду
	Если ЗначениеЗаполнено(Билет) Тогда
		УсловиеГДЕТаблицыБилетов.Добавить(Новый ВыражениеСхемыЗапроса("Билеты.Ссылка = &Билет"));
		Запрос.УстановитьПараметр("Билет", Билет);
	ИначеЕсли ПериодНачало <> Неопределено И ПериодОкончание <> Неопределено Тогда
		УсловиеГДЕТаблицыБилетов.Добавить(Новый ВыражениеСхемыЗапроса("Билеты.ДатаОтправления МЕЖДУ &ПериодНачало И &ПериодОкончание"));
		УсловиеГДЕТаблицыБилетов.Добавить(Новый ВыражениеСхемыЗапроса("Билеты.ДатаПокупки <= &ПериодОкончание"));
		Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
		Запрос.УстановитьПараметр("ПериодОкончание", ПериодОкончание);
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		УсловиеГДЕТаблицыБилетов.Добавить(Новый ВыражениеСхемыЗапроса("Билеты.Сотрудник = &Сотрудник"));
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	КонецЕсли;
	
	// Если данные по оплате билетов не требуются, то возвращаем таблицу с результатом...
	Если Не ВыбиратьДанныеОплаты Тогда
		Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	// ... В ином случае результат помещается во временную таблицу СуммыБилетов - ниже она используется 
	// для получения итогового результата
	СхемаЗапроса.ПакетЗапросов[1].ТаблицаДляПомещения = "СуммыБилетов";
	
	// Далее пытаемся найти последний документ оплаты по каждому билету. Для этого требуется несколько шагов:
	// 1. Находим все операции по каждому билету - это документы расчетов на счетах расчетов с поставщиками.
	// 2. Находим документы оплаты из проводок вида:
	//    2.1. ДТ [счет расчетов] / [операция по билету из п.1] - КТ [счет банк/касса]
	//	       Оплата по билету. Регистратор для такой проводки (списание ДС или РКО) - искомый документ оплаты.
	//    2.2. ДТ [счет расчетов] / [операция по билету из п.1] - КТ [счет авансов]
	//	       Зачет аванса в счет покупки билета. Документ расчетов по Кт (списание ДС или РКО) - искомый документ оплаты.
	//    Прочие варианты проводок (зачет аванса по предшествующему возврату, оплата в виде корректировки долга, бух операции и т.п.)
	//    считаем ненадежными.
	// 3. Определяем последний по времени документ оплаты по каждому билету, а также выбираем реквизиты документа оплаты.
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса() + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета() +
	"ВЫБРАТЬ
	|	Билеты.Ссылка КАК Билет,
	|	ОперацияСБилетом.Ссылка КАК ДокументРасчетов
	|ПОМЕСТИТЬ ДокументыРасчетовПоБилетам
	|ИЗ
	|	Документ.ОперацияСБилетом КАК ОперацияСБилетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Билеты КАК Билеты
	|		ПО ОперацияСБилетом.Билет = Билеты.Ссылка
	|ГДЕ
	|	ОперацияСБилетом.Проведен
	|	И ОперацияСБилетом.Организация = &Организация
	|	И ОперацияСБилетом.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСБилетами.Обмен)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Билеты.Ссылка,
	|	ОперацияСБилетом.Ссылка
	|ИЗ
	|	Документ.ОперацияСБилетом КАК ОперацияСБилетом
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Билеты КАК Билеты
	|		ПО ОперацияСБилетом.БилетЗамена = Билеты.Ссылка
	|ГДЕ
	|	ОперацияСБилетом.Проведен
	|	И ОперацияСБилетом.Организация = &Организация
	|	И ОперацияСБилетом.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСБилетами.Обмен)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДокументыРасчетовПоБилетам.ДокументРасчетов КАК ДокументРасчетов
	|ИЗ
	|	ДокументыРасчетовПоБилетам КАК ДокументыРасчетовПоБилетам";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	// При отложенном проведении требуется актуализировать расчеты для корректного поиска документа оплаты.
	// В процедуру актуализации передаем массив документов расчетов (операции с выбранными билетами).	
	ДокументыРасчетов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ДокументРасчетов");
	
	ПараметрыРасчета = УчетВзаиморасчетовОтложенноеПроведение.НовыеПараметрыРасчета();
	ПараметрыРасчета.Организация = Организация;
	ПараметрыРасчета.Документ = ДокументыРасчетов;
	
	ДатаОкончания = ОбщегоНазначения.ТекущаяДатаПользователя();
	Если ЗначениеЗаполнено(ПериодОкончание) Тогда
		ДатаОкончания = ПериодОкончание;
	ИначеЕсли ЗначениеЗаполнено(ТекущийДокумент) Тогда
		ДатаОкончания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийДокумент, "Дата");
	КонецЕсли;	
	ДатаОкончания = Новый Граница(КонецДня(ДатаОкончания), ВидГраницы.Включая);
	
	ПараметрыРасчета.ДатаОкончания = ДатаОкончания.Значение;
	
	// Ошибку актуализации специально не обрабатываем - в этом случае в таблице билетов 
	// не будут заполнены реквизиты документов оплаты.
	УчетВзаиморасчетовОтложенноеПроведение.ВыполнитьОтложенныеРасчеты(ПараметрыРасчета);
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1 КАК ДокументРасчетов,
	|	ХозрасчетныйОборотыДтКт.Регистратор КАК ДокументОплаты
	|ПОМЕСТИТЬ ВсеДокументыОплаты
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			,
	|			&Период,
	|			Регистратор,
	|			СчетДт В (&СчетаРасчетов),
	|			&СубконтоДокументРасчетов,
	|			СчетКт В (&СчетаБанкКасса),
	|			,
	|			СубконтоДт1 В
	|				(ВЫБРАТЬ
	|					ДокументыРасчетовПоБилетам.ДокументРасчетов
	|				ИЗ
	|					ДокументыРасчетовПоБилетам)) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.СписаниеСРасчетногоСчета
	|			ИЛИ ХозрасчетныйОборотыДтКт.Регистратор ССЫЛКА Документ.РасходныйКассовыйОрдер
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОборотыДтКт.СубконтоДт1,
	|	ХозрасчетныйОборотыДтКт.СубконтоКт1
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
	|			,
	|			&Период,
	|			,
	|			СчетДт В (&СчетаРасчетов),
	|			&СубконтоДокументРасчетов,
	|			СчетКт В (&СчетаАвансов),
	|			&СубконтоДокументРасчетов,
	|			СубконтоДт1 В
	|				(ВЫБРАТЬ
	|					ДокументыРасчетовПоБилетам.ДокументРасчетов
	|				ИЗ
	|					ДокументыРасчетовПоБилетам)) КАК ХозрасчетныйОборотыДтКт
	|ГДЕ
	|	ХозрасчетныйОборотыДтКт.СубконтоКт1 ССЫЛКА Документ.СписаниеСРасчетногоСчета
	|			ИЛИ ХозрасчетныйОборотыДтКт.СубконтоКт1 ССЫЛКА Документ.РасходныйКассовыйОрдер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыРасчетовПоБилетам.Билет КАК Билет,
	|	ВсеДокументыОплаты.ДокументОплаты КАК ДокументОплаты
	|ПОМЕСТИТЬ ОплатаБилетов
	|ИЗ
	|	ДокументыРасчетовПоБилетам КАК ДокументыРасчетовПоБилетам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсеДокументыОплаты КАК ВсеДокументыОплаты
	|		ПО ДокументыРасчетовПоБилетам.ДокументРасчетов = ВсеДокументыОплаты.ДокументРасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОплатаБилетов.Билет КАК Билет,
	|	ВЫБОР
	|		КОГДА ДанныеПервичныхДокументов.Номер = """"
	|			ТОГДА ДанныеПервичныхДокументов.НомерРегистратора
	|		ИНАЧЕ ДанныеПервичныхДокументов.Номер
	|	КОНЕЦ КАК НомерДокументаОплаты,
	|	ВЫБОР
	|		КОГДА ДанныеПервичныхДокументов.Дата = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДанныеПервичныхДокументов.ДатаРегистратора
	|		ИНАЧЕ ДанныеПервичныхДокументов.Дата
	|	КОНЕЦ КАК ДатаДокументаОплаты
	|ПОМЕСТИТЬ РеквизитыОплатБилетов
	|ИЗ
	|	ОплатаБилетов КАК ОплатаБилетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО ДанныеПервичныхДокументов.Организация = &Организация
	|			И ОплатаБилетов.ДокументОплаты = ДанныеПервичныхДокументов.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыОплатБилетов.Билет КАК Билет,
	|	МАКСИМУМ(РеквизитыОплатБилетов.ДатаДокументаОплаты) КАК ДатаДокументаОплаты
	|ПОМЕСТИТЬ ПоследниеОплатыПоБилетам
	|ИЗ
	|	РеквизитыОплатБилетов КАК РеквизитыОплатБилетов
	|
	|СГРУППИРОВАТЬ ПО
	|	РеквизитыОплатБилетов.Билет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыОплатБилетов.Билет КАК Билет,
	|	МАКСИМУМ(РеквизитыОплатБилетов.НомерДокументаОплаты) КАК НомерДокументаОплаты,
	|	МАКСИМУМ(РеквизитыОплатБилетов.ДатаДокументаОплаты) КАК ДатаДокументаОплаты
	|ПОМЕСТИТЬ ДанныеОплаты
	|ИЗ
	|	РеквизитыОплатБилетов КАК РеквизитыОплатБилетов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследниеОплатыПоБилетам КАК ПоследниеОплатыПоБилетам
	|		ПО РеквизитыОплатБилетов.Билет = ПоследниеОплатыПоБилетам.Билет
	|			И РеквизитыОплатБилетов.ДатаДокументаОплаты = ПоследниеОплатыПоБилетам.ДатаДокументаОплаты
	|
	|СГРУППИРОВАТЬ ПО
	|	РеквизитыОплатБилетов.Билет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыБилетов.Билет КАК Билет,
	|	СуммыБилетов.Сумма КАК Сумма,
	|	СуммыБилетов.СуммаНДС КАК СуммаНДС,
	|	СуммыБилетов.СтавкаНДС КАК СтавкаНДС,
	|	СуммыБилетов.ПодразделениеОрганизации КАК ПодразделениеЗатрат,
	|	ЕСТЬNULL(ДанныеОплаты.НомерДокументаОплаты, """") КАК НомерДокументаОплаты,
	|	ЕСТЬNULL(ДанныеОплаты.ДатаДокументаОплаты, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДокументаОплаты
	|ИЗ
	|	СуммыБилетов КАК СуммыБилетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеОплаты КАК ДанныеОплаты
	|		ПО СуммыБилетов.Билет = ДанныеОплаты.Билет";
	
	Запрос.УстановитьПараметр("Период", КонецДня(ПериодОкончание));
	Запрос.УстановитьПараметр("СубконтоДокументРасчетов", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами);
	
	СчетаРасчетов = Новый Массив;
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщиками);                           // 60.01
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками);       // 76.05
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);    // 76.09
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиВал);                        // 60.21
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал);    // 76.25
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиВал); // 76.29
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиУЕ);                         // 60.31
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиУЕ);     // 76.35
	СчетаРасчетов.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторамиУЕ);  // 76.39
	
	СчетаБанкКасса = Новый Массив;
	СчетаБанкКасса.Добавить(ПланыСчетов.Хозрасчетный.Касса);                                         // 50
	СчетаБанкКасса.Добавить(ПланыСчетов.Хозрасчетный.РасчетныеСчета);                                // 51
	СчетаБанкКасса.Добавить(ПланыСчетов.Хозрасчетный.ВалютныеСчета);                                 // 52
	
	СчетаАвансов = Новый Массив;
	СчетаАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);                        // 60.02
	СчетаАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданнымВал);                     // 60.22
	СчетаАвансов.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданнымУЕ);                      // 60.32
	
	Запрос.УстановитьПараметр("СчетаРасчетов", БухгалтерскийУчет.СформироватьМассивСубсчетов(СчетаРасчетов));
	Запрос.УстановитьПараметр("СчетаБанкКасса", БухгалтерскийУчет.СформироватьМассивСубсчетов(СчетаБанкКасса));
	Запрос.УстановитьПараметр("СчетаАвансов", БухгалтерскийУчет.СформироватьМассивСубсчетов(СчетаАвансов));
	
	ТаблицаСуммыБилетов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаБилета Из ТаблицаСуммыБилетов Цикл
		СтрокаБилета.НомерДокументаОплаты = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(
			СтрокаБилета.НомерДокументаОплаты, 
			Истина, 
			Истина)
	КонецЦикла;
	
	Возврат ТаблицаСуммыБилетов;
	
КонецФункции

Функция ВидыДоговоровАгента() Экспорт 

 	ВидыДоговоров = Новый Массив;

    ВидыДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
    ВидыДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);

    Возврат ВидыДоговоров;

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#КонецОбласти

#КонецЕсли
